In [1]:
import pandas as pd

# creating a dictionary

In [37]:
x={'day':[1,2,3,4,5,6],'visitors':[65,77,422,623,432,321],'sold':[98,65,56,78,34,41]}

In [3]:
x

{'day': [1, 2, 3, 4, 5, 6],
 'visitors': [65, 77, 422, 623, 432, 321],
 'sold': [98, 65, 56, 78, 34, 41]}

# converting the dictionary to DataFrame

In [4]:
y=pd.DataFrame(x)

In [5]:
y

   day  visitors  sold
0    1        65    98
1    2        77    65
2    3       422    56
3    4       623    78
4    5       432    34
5    6       321    41

# slicing operation

In [6]:
y.head(2)

   day  visitors  sold
0    1        65    98
1    2        77    65

In [7]:
y.head(1)

   day  visitors  sold
0    1        65    98

In [8]:
y.tail(1)

   day  visitors  sold
5    6       321    41

In [9]:
y.tail(2)

   day  visitors  sold
4    5       432    34
5    6       321    41

In [10]:
y.loc[3]

day           4
visitors    623
sold         78
Name: 3, dtype: int64

In [11]:
max(y['sold'])

98

In [12]:
y.loc[y['visitors']==min(y['visitors'])]

   day  visitors  sold
0    1        65    98

# info

In [14]:
y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   day       6 non-null      int64
 1   visitors  6 non-null      int64
 2   sold      6 non-null      int64
dtypes: int64(3)
memory usage: 272.0 bytes

In [15]:
y.shape

(6, 3)

In [16]:
y

   day  visitors  sold
0    1        65    98
1    2        77    65
2    3       422    56
3    4       623    78
4    5       432    34
5    6       321    41

# Joining (adding columns)

In [20]:
a={'income':[5000,6000,4000,3000,8000,7000],'spend':[4000,4000,4000,4000,4000,4000]}
b=pd.DataFrame(a)
b

   income  spend
0    5000   4000
1    6000   4000
2    4000   4000
3    3000   4000
4    8000   4000
5    7000   4000

In [21]:
f=y.join(b)
f

   day  visitors  sold  income  spend
0    1        65    98    5000   4000
1    2        77    65    6000   4000
2    3       422    56    4000   4000
3    4       623    78    3000   4000
4    5       432    34    8000   4000
5    6       321    41    7000   4000

# Concatination (adding rows)

In [22]:
y

   day  visitors  sold
0    1        65    98
1    2        77    65
2    3       422    56
3    4       623    78
4    5       432    34
5    6       321    41

In [23]:
a={'day':[7,8],'visitors':[240,420],'sold':[56,75]}
a

{'day': [7, 8], 'visitors': [240, 420], 'sold': [56, 75]}

In [24]:
b=pd.DataFrame(a)
b

   day  visitors  sold
0    7       240    56
1    8       420    75

In [25]:
f=pd.concat([y,b])
f

   day  visitors  sold
0    1        65    98
1    2        77    65
2    3       422    56
3    4       623    78
4    5       432    34
5    6       321    41
0    7       240    56
1    8       420    75

In [26]:
x={'day':[1,2,3,4,5,6],'visitors':[65,77,422,623,432,321],'sold':[98,65,56,78,34,41]}
y=pd.DataFrame(x,index=[0,1,2,3,4,5])
a={'day':[7,8],'visitors':[240,420],'sold':[56,75]}
b=pd.DataFrame(a,index=[6,7])

In [27]:
b

   day  visitors  sold
6    7       240    56
7    8       420    75

In [28]:
f=pd.concat([y,b])
f

   day  visitors  sold
0    1        65    98
1    2        77    65
2    3       422    56
3    4       623    78
4    5       432    34
5    6       321    41
6    7       240    56
7    8       420    75

# setting a column as index

In [30]:
t=f.set_index('day')

In [31]:
t

     visitors  sold
day
1          65    98
2          77    65
3         422    56
4         623    78
5         432    34
6         321    41
7         240    56
8         420    75

In [32]:
f

   day  visitors  sold
0    1        65    98
1    2        77    65
2    3       422    56
3    4       623    78
4    5       432    34
5    6       321    41
6    7       240    56
7    8       420    75

In [33]:
f.set_index('day',inplace=True)

In [34]:
f

     visitors  sold
day
1          65    98
2          77    65
3         422    56
4         623    78
5         432    34
6         321    41
7         240    56
8         420    75

# Renaming a column

In [35]:
t=f.rename(columns={'visitors':'browsers'})
t

     browsers  sold
day
1          65    98
2          77    65
3         422    56
4         623    78
5         432    34
6         321    41
7         240    56
8         420    75

# Saving DataFrame as csv(excel sheet)

In [36]:
t.to_csv('my_bakery.csv')

In [38]:
x={'day':[1,2,3,4,5,6],'visitors':[65,77,422,623,432,321],'sold':[98,65,56,78,34,41]}
y=pd.DataFrame(x)
y

   day  visitors  sold
0    1        65    98
1    2        77    65
2    3       422    56
3    4       623    78
4    5       432    34
5    6       321    41

# Saving the Dataframe without index

In [40]:
y.to_csv("my_bakery_new.csv",index=False)

# Loading the data

In [52]:
data=pd.read_csv("my_bakery_new.csv")

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   day       6 non-null      int64
 1   visitors  6 non-null      int64
 2   sold      6 non-null      int64
dtypes: int64(3)
memory usage: 272.0 bytes

In [54]:
data.head(2)

   day  visitors  sold
0    1        65    98
1    2        77    65

In [55]:
data.tail(1)

   day  visitors  sold
5    6       321    41

In [56]:
data.describe()

            day    visitors       sold
count  6.000000    6.000000   6.000000
mean   3.500000  323.333333  62.000000
std    1.870829  218.524751  23.757104
min    1.000000   65.000000  34.000000
25%    2.250000  138.000000  44.750000
50%    3.500000  371.500000  60.500000
75%    4.750000  429.500000  74.750000
max    6.000000  623.000000  98.000000

In [57]:
data=pd.read_csv("AuthorisedDetails.csv")

In [58]:
data

       Id      Name
0  9460.0     palvi
1     NaN       NaN
2  9461.0   simaran
3     NaN       NaN
4  9462.0   raveena
5     NaN       NaN
6     NaN       NaN
7     NaN       NaN
8     NaN       NaN
9  9463.0  avantika

In [59]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Id      4 non-null      float64
 1   Name    4 non-null      object
dtypes: float64(1), object(1)
memory usage: 288.0+ bytes

In [62]:
data.isnull().any()

Id      True
Name    True
dtype: bool

In [63]:
data.isnull()

      Id   Name
0  False  False
1   True   True
2  False  False
3   True   True
4  False  False
5   True   True
6   True   True
7   True   True
8   True   True
9  False  False

In [65]:
data.isnull().sum()

Id      6
Name    6
dtype: int64

In [66]:
data.dropna(inplace=True)

In [67]:
data

       Id      Name
0  9460.0     palvi
2  9461.0   simaran
4  9462.0   raveena
9  9463.0  avantika

In [68]:
data.to_csv("new_data.csv",index=False)